seed: 42
batch_size: 32
learning_rate: 0.001
epochs: 100
patience: 5
input_size: 224
screen_width: 1440
screen_height: 900
data_path: /Users/ariana/CLionProjects/untitled/dataset

----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 112, 112]           9,472
       BatchNorm2d-2         [-1, 64, 112, 112]             128
              ReLU-3         [-1, 64, 112, 112]               0
         MaxPool2d-4           [-1, 64, 56, 56]               0
            Conv2d-5          [-1, 128, 56, 56]          73,856
       BatchNorm2d-6          [-1, 128, 56, 56]             256
              ReLU-7          [-1, 128, 56, 56]               0
            Conv2d-8          [-1, 128, 56, 56]         147,584
       BatchNorm2d-9          [-1, 128, 56, 56]             256
             ReLU-10          [-1, 128, 56, 56]               0
           Conv2d-11          [-1, 256, 28, 28]         295,168
      BatchNorm2d-12          [-1, 256, 28, 28]             512
             ReLU-13          [-1, 256, 28, 28]               0
           Conv2d-14          [-1, 256, 28, 28]         590,080
      BatchNorm2d-15          [-1, 256, 28, 28]             512
             ReLU-16          [-1, 256, 28, 28]               0
           Conv2d-17          [-1, 512, 14, 14]       1,180,160
      BatchNorm2d-18          [-1, 512, 14, 14]           1,024
             ReLU-19          [-1, 512, 14, 14]               0
           Conv2d-20          [-1, 512, 14, 14]       2,359,808
      BatchNorm2d-21          [-1, 512, 14, 14]           1,024
             ReLU-22          [-1, 512, 14, 14]               0
           Conv2d-23            [-1, 512, 7, 7]       2,359,808
      BatchNorm2d-24            [-1, 512, 7, 7]           1,024
             ReLU-25            [-1, 512, 7, 7]               0
           Conv2d-26            [-1, 512, 7, 7]       2,359,808
      BatchNorm2d-27            [-1, 512, 7, 7]           1,024
             ReLU-28            [-1, 512, 7, 7]               0
AdaptiveAvgPool2d-29            [-1, 512, 1, 1]               0
          Flatten-30                  [-1, 512]               0
           Linear-31                 [-1, 1024]         525,312
             ReLU-32                 [-1, 1024]               0
          Dropout-33                 [-1, 1024]               0
           Linear-34                  [-1, 512]         524,800
             ReLU-35                  [-1, 512]               0
          Dropout-36                  [-1, 512]               0
           Linear-37                  [-1, 256]         131,328
             ReLU-38                  [-1, 256]               0
           Linear-39                    [-1, 2]             514
================================================================
Total params: 10,563,458
Trainable params: 10,563,458
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 53.26
Params size (MB): 40.30
Estimated Total Size (MB): 94.13
----------------------------------------------------------------